benchmark/results/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.279ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.279ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.283ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.287ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  576.38us   4.63ms   67.41%
    Req/Sec    26.30k     1.81k   32.67k    72.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.65ms
 90.000%    2.04ms
 99.000%    2.82ms
 99.900%    3.28ms
 99.990%    3.67ms
 99.999%    4.00ms
100.000%    4.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.031     0.000000            1         1.00
       0.571     0.100000       396592         1.11
       0.754     0.200000       791739         1.25
       0.913     0.300000      1187306         1.43
       1.078     0.400000      1581906         1.67
       1.241     0.500000      1976970         2.00
       1.321     0.550000      2175330         2.22
       1.401     0.600000      2373370         2.50
       1.481     0.650000      2570007         2.86
       1.564     0.700000      2767436         3.33
       1.653     0.750000      2964841         4.00
       1.701     0.775000      3064468         4.44
       1.753     0.800000      3163643         5.00
       1.809     0.825000      3260929         5.71
       1.874     0.850000      3360284         6.67
       1.950     0.875000      3459198         8.00
       1.994     0.887500      3508274         8.89
       2.044     0.900000      3557949        10.00
       2.099     0.912500      3607422        11.43
       2.161     0.925000      3656502        13.33
       2.237     0.937500      3705943        16.00
       2.281     0.943750      3730904        17.78
       2.329     0.950000      3755672        20.00
       2.379     0.956250      3779504        22.86
       2.435     0.962500      3804294        26.67
       2.497     0.968750      3829062        32.00
       2.531     0.971875      3841256        35.56
       2.569     0.975000      3853868        40.00
       2.609     0.978125      3866180        45.71
       2.653     0.981250      3878349        53.33
       2.705     0.984375      3891040        64.00
       2.731     0.985938      3896814        71.11
       2.761     0.987500      3902973        80.00
       2.795     0.989062      3909278        91.43
       2.835     0.990625      3915594       106.67
       2.879     0.992188      3921715       128.00
       2.903     0.992969      3924643       142.22
       2.931     0.993750      3927788       160.00
       2.961     0.994531      3930888       182.86
       2.995     0.995313      3933998       213.33
       3.031     0.996094      3936987       256.00
       3.053     0.996484      3938589       284.44
       3.073     0.996875      3940036       320.00
       3.099     0.997266      3941628       365.71
       3.125     0.997656      3943158       426.67
       3.155     0.998047      3944663       512.00
       3.173     0.998242      3945453       568.89
       3.195     0.998437      3946235       640.00
       3.219     0.998633      3946990       731.43
       3.245     0.998828      3947739       853.33
       3.281     0.999023      3948523      1024.00
       3.301     0.999121      3948912      1137.78
       3.323     0.999219      3949287      1280.00
       3.347     0.999316      3949671      1462.86
       3.377     0.999414      3950056      1706.67
       3.415     0.999512      3950461      2048.00
       3.431     0.999561      3950643      2275.56
       3.453     0.999609      3950851      2560.00
       3.475     0.999658      3951020      2925.71
       3.499     0.999707      3951214      3413.33
       3.529     0.999756      3951414      4096.00
       3.543     0.999780      3951504      4551.11
       3.563     0.999805      3951602      5120.00
       3.583     0.999829      3951696      5851.43
       3.607     0.999854      3951792      6826.67
       3.641     0.999878      3951892      8192.00
       3.659     0.999890      3951944      9102.22
       3.671     0.999902      3951986     10240.00
       3.691     0.999915      3952036     11702.86
       3.715     0.999927      3952085     13653.33
       3.745     0.999939      3952130     16384.00
       3.761     0.999945      3952154     18204.44
       3.783     0.999951      3952178     20480.00
       3.799     0.999957      3952206     23405.71
       3.823     0.999963      3952228     27306.67
       3.849     0.999969      3952250     32768.00
       3.861     0.999973      3952263     36408.89
       3.871     0.999976      3952278     40960.00
       3.885     0.999979      3952287     46811.43
       3.903     0.999982      3952298     54613.33
       3.931     0.999985      3952310     65536.00
       3.949     0.999986      3952317     72817.78
       3.965     0.999988      3952322     81920.00
       3.987     0.999989      3952328     93622.86
       4.005     0.999991      3952334    109226.67
       4.035     0.999992      3952342    131072.00
       4.037     0.999993      3952343    145635.56
       4.043     0.999994      3952346    163840.00
       4.057     0.999995      3952349    187245.71
       4.073     0.999995      3952352    218453.33
       4.079     0.999996      3952355    262144.00
       4.093     0.999997      3952357    291271.11
       4.115     0.999997      3952358    327680.00
       4.163     0.999997      3952361    374491.43
       4.163     0.999998      3952361    436906.67
       4.183     0.999998      3952363    524288.00
       4.207     0.999998      3952364    582542.22
       4.207     0.999998      3952364    655360.00
       4.215     0.999999      3952365    748982.86
       4.219     0.999999      3952366    873813.33
       4.231     0.999999      3952367   1048576.00
       4.231     0.999999      3952367   1165084.44
       4.231     0.999999      3952367   1310720.00
       4.255     0.999999      3952368   1497965.71
       4.255     0.999999      3952368   1747626.67
       4.287     1.000000      3952369   2097152.00
       4.287     1.000000      3952369   2330168.89
       4.287     1.000000      3952369   2621440.00
       4.287     1.000000      3952369   2995931.43
       4.287     1.000000      3952369   3495253.33
       4.635     1.000000      3952370   4194304.00
       4.635     1.000000      3952370          inf
#[Mean    =        1.282, StdDeviation   =        0.576]
#[Max     =        4.632, Total count    =      3952370]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5937779 requests in 30.00s, 736.15MB read
Requests/sec: 197929.78
Transfer/sec:     24.54MB